Autodesk.Revit.DB.LineScaling
An enumerated type listing possible LineType scaling modes.
Remarks:
Whichever option is chosen, line type definitions are created so a dashed line always begins and ends with a dash.
Using these options does change the default behavior of exported DWGs. Some lines expected to be dashed may appear solid or in a different scale.

Autodesk.Revit.DB.LineScaling.PaperSpace
Paperspace scaling. Specifies the value 1 for both LTSCALE and PSLTSCALE.

Autodesk.Revit.DB.LineScaling.ModelSpace
Modelspace scaling. LTSCALE is set to view scale and PSLTSCALE to 0.

Autodesk.Revit.DB.LineScaling.ViewScale
Exporting lines as they were scaled by view scale. This option preserves visual fidelity.